Revit 2024 API
ThinLinesOptions Properties
The ThinLinesOptions type exposes the following members.
Properties
Name | Description
AreThinLinesEnabled
 A static property defining if the 'Thin Lines' setting is on or off in current Revit Application Session.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ThinLinesOptions Class
Autodesk.Revit.UI Namespace